[
    {
      "id": 1,
      "question": "You live in an English speaking country and you want to do some voluntary, unpaid work in a developing country. Write a letter to a company called Cultural Expeditions, which organizes such trips. In your letter, explain why you want to do the voluntary work, state what your skills and experience are, and indicate where you would like to volunteer and for how long."
    },
    {
      "id": 2,
      "question": "You have decided to apply for a job as a Spanish instructor that was advertised in the April edition of the magazine Teaching Professional. This ad was posted by Mr John Sullivan, director of the Spanish department at The Language Institute of Great Britain in London, England. Write a letter to Mr Sullivan, explain why you are writing, describe your qualifications and experience, and explain how they can contact you."
    },
    {
      "id": 3,
      "question": "You are looking for a part-time job. Write a letter to an employment agency. In your letter, introduce yourself, explain what sort of job you would like, and say what experience and skills you have."
    },
    {
      "id": 4,
      "question": "Last Tuesday you flew from New York to Paris. When you arrived home, you discovered that you had left your cabin bag on the plane. Write a letter to the airline. In your letter, explain where and when you lost your bag, what your bag looks like, and what its contents were."
    },
    {
      "id": 5,
      "question": "You have seen an advertisement for part-time work in a hotel for three months over the summer. Write a letter to the manager. In your letter, say what experience you have, ask what the work involves, and enquire about conditions."
    },
    {
      "id": 6,
      "question": "You normally go shopping in the area where you live. However, you think some of the facilities for shoppers could be improved. Write a letter to your local newspaper. In your letter, say in general what you like about shopping in your area, say what is wrong with the facilities, and suggest how they can be improved."
    },
    {
      "id": 7,
      "question": "You would like a temporary job working in the summer camp which runs sports and outdoor activities for children and young people next summer. Write a letter to the organizers of the summer camp. In your letter, explain what sort of job you would like to do, describe your personality, and say what experience and skills you have."
    },
    {
      "id": 8,
      "question": "You live in a small university town. Last week, you drove to a big city about two hours away to buy a new laptop at a good price. You worked on the laptop all week and finished writing a long assignment that is due shortly. However, this week, the laptop doesn’t even switch on. Write to the store. In your letter, tell the store where you live and what happened, explain the problem with the laptop, and state what action you would like the store to take."
    },
    {
      "id": 9,
      "question": "You are interested in taking a part-time course at a local college and would like some more information before you enroll. Write a letter to the college administration. In your letter, describe the course you are interested in, ask about the course content and schedule, and inquire about any prerequisites or qualifications needed."
    },
    {
      "id": 10,
      "question": "You recently attended a community event in your neighborhood, but you believe that it could be improved for future occasions. Write a letter to the event organizers. In your letter, mention what you enjoyed about the event, highlight areas that you think could be better organized, and offer suggestions for making the event more enjoyable for everyone."
    }
  ]
  